Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.GetLevelIdsInRange
Returns level ids between the top level and the bottom level (including the top level and the bottom level) of
the area based load boundary line.
Returns:
The level ids between the top level and the bottom level (including the top level and the bottom level).
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.IsElevationWithinRange(System.Double)
Checks whether the given elevation is between the bottom level and the top level(including
the bottom level and the top level) of the area based load boundary line.
elev:
The elevation value.
Returns:
True if given elevation is between the bottom level elevation and the top level elevation, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for elev is not a number
-or-
The given value for elev is not finite
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.IsLevelWithinRange(Autodesk.Revit.DB.ElementId)
Checks whether the given level is between the bottom level and the top level (including
the bottom level and the top level) of the area based load boundary line.
levelId:
The id of the Level.
Returns:
True if given level is between the bottom level and the top level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.TopLevelId
The top level id of the area based load boundary line.
Remarks:
The top level's elevation cannot be lower than the bottom level.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The ElementId levelId cannot be used as the top level.
The ElementId levelId is not a Level or it's elevation is lower than the bottom level's elevation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData.BottomLevelId
The bottom level id of the area based load boundary line.
Remarks:
The bottom level's elevation cannot be higher than the top level.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The ElementId levelId cannot be used as the bottom level.
The ElementId levelId is not a Level or it's elevation is higher than the top level's elevation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData
Wrapper class used to access area based load boundary line related data.
Since:
2023